Repository: biblibre/omeka-s-module-Formularium
Catalog: language/*.po
Languages: fr

source: Affected form submissions
fr: Soumissions de formulaire affectées

source: You are editing the following %s form submissions:
fr: Vous êtes en train de modifier les %s soumissions de formulaire suivantes:

source: You are editing %s form submissions.
fr: Vous êtes en train de modifier %s soumissions de formulaire.

source: Form submissions
fr: Soumissions de formulaire

source: Submitted
fr: Soumis

source: Submitted by
fr: Soumis par

source: Handled
fr: Traité

source: Select form submission
fr: Sélectionner la soumission de formulaire

source: Mark as not handled
fr: Marquer comme non-traité

source: Mark as handled
fr: Marquer comme traité

source: Delete form submissions
fr: Supprimer les soumissions de formulaire

source: Are you sure you would like to delete the selected form submissions?
fr: Êtes-vous sûr de vouloir supprimer les soumissions de formulaire sélectionnées ?

source: %1$s: this action will permanently delete %2$s form submissions and cannot be undone.
fr: %1$s: cette action va supprimer définitivement %2$s soumissions de formulaire et ne peut pas être annulée.

source: Are you sure you would like to delete all form submissions on all pages of this result?
fr: Êtes-vous sûr de vouloir supprimer toutes les soumissions de formulaire sur toutes les pages de ces résultats ?

source: Omeka could not find any forms.
fr: Omeka n'a trouvé aucun formulaire.

source: Mark form submission as handled
fr: Marquer la soumission de formulaire comme traitée

source: Are you sure you would like to mark this form submission as handled ?
fr: Êtes-vous sûr de vouloir marquer cette soumission de formulaire comme traitée ?

source: Mark form submission as not handled
fr: Marquer la soumission de formulaire comme non-traitée

source: Are you sure you would like to mark this form submission as not handled ?
fr: Êtes-vous sûr de vouloir marquer cette soumission de formulaire comme non traitée ?

source: Has been submitted by
fr: A été soumis par

source: Has been handled by
fr: A été traité par

source: Form
fr: Formulaire

source: by
fr: par

source: Files
fr: Fichiers

source: Data
fr: Données

source: Add a action
fr: Ajouter une action

source: New form
fr: Nouveau formulaire

source: Forms
fr: Formulaires

source: Add new form
fr: Ajouter un nouveau formulaire

source: Submissions
fr: Soumissions

source: Add a component
fr: Ajouter un composant

source: Edit form
fr: Modifier le formulaire

source: [Unknown action type]
fr: [Type d'action inconnu]

source: Action to delete
fr: Action à supprimer

source: Internal label
fr: Libellé interne

source: Edit action
fr: Modifier l'action

source: Remove action
fr: Supprimer l'action

source: Restore action
fr: Restaurer l'action

source: Add an action
fr: Ajouter une action

source: [Unknown component type]
fr: [Type de composant inconnu]

source: Component to delete
fr: Composant à supprimer

source: Edit component
fr: Modifier le composant

source: Remove component
fr: Supprimer le composant

source: Restore component
fr: Restaurer le composant

source: Not handled submissions:
fr: Soumissions non traitées:

source: Is handled
fr: Est traitée

source: Submission date
fr: Date de soumission

source: Handling date
fr: Date de traitement

source: Checkbox
fr: Case à cocher

source: Accepted file types
fr: Types de fichiers acceptés

source: A comma-separated list of file types.<br>For instance: <code>image/jpeg,application/pdf</code>.
fr: Une liste de types de fichier séparés par des virgules.<br>Par exemple:<code>image/jpeg,application/pdf</code>.

source: Accepted file extensions
fr: Extensions de fichier acceptées

source: A comma-separated list of file extension.<br>For instance: <code>jpg,pdf</code>.
fr: Une liste d'extensions de fichier séparés par des virgules.<br>Par exemple:<code>jpg,pdf</code>.

source: Maximum file size
fr: Taille de fichier maximale

source: Size in bytes, or in SI notation.<br>For instance: <code>10485760</code> or <code>10MB</code>.
fr: Taille en octets, ou en notation SI.<br>Par exemple:<code>10485760</code> ou <code>10MB</code>.

source: Text area
fr: Zone de texte

source: Text input
fr: Champ texte

source: Dropdown list
fr: Liste déroulante

source: One option per line
fr: Une option par ligne

source: Help text
fr: Texte d'aide

source: User e-mail address
fr: Adresse e-mail de l'utilisateur

source: Send an email
fr: Envoyer un e-mail

source: To
fr: À

source: Form successfully created.
fr: Formulaire créé avec succès.

source: Form successfully updated.
fr: Formulaire modifié avec succès.

source: form
fr: formulaire

source: Form successfully deleted
fr: Formulaire supprimé avec succès

source: form submission
fr: soumission de formulaire

source: Form submission successfully deleted
fr: Soumission de formulaire supprimée avec succès

source: You must select at least one form submission to batch delete.
fr: Vous devez sélectionner au moins une soumission de formulaire à supprimer

source: Form submissions successfully deleted
fr: Soumissions de formulaire supprimées avec succès

source: Deleting form submissions. This may take a while.
fr: Suppression des soumissions de formulaire. Cela peut prendre un certain temps.

source: You must select at least one form submission to batch edit.
fr: Vous devez sélectionner au moins une soumission de formulaire à modifier.

source: Form submission successfully edited
fr: Soumission de formulaire modifiée avec succès

source: Editing form submissions. This may take a while.
fr: Modification des soumissions de formulaire. Cela peut prendre un certain temps.
