Repository: biblibre/omeka-s-module-Formularium
Catalog: documentation/locales/*/LC_MESSAGES/documentation.po
Languages: fr

source: Form actions
fr: Actions de formulaire

source: Send an email
fr: Envoyer un e-mail

source: Send an email.
fr: Envoyer un e-mail.

source: All settings can contain special tokens that will be replaced by data from the form submission.
fr: Tous les paramètres peuvent contenir des jetons spéciaux qui seront remplacés par des données venant de la soumission du formulaire.

source: For instance, if the form contains a text input named ``email``, you can set the "To" parameter to ``{email}`` to send an email to the user that submitted the form.
fr: Par exemple, si le formulaire contient un champ texte nommé ``email``, vous pouvez définir le paramètre "À" à ``{email}`` pour envoyer un e-mail à l'utilisateur qui a soumis le formulaire.

source: Settings
fr: Paramètres

source: To
fr: À

source: The e-mail recipient
fr: Le destinataire de l'e-mail

source: Subject
fr: Sujet

source: The e-mail subject
fr: Le sujet de l'e-mail

source: Body
fr: Corps

source: The e-mail body
fr: Le corps de l'e-mail

source: Form components
fr: Composants du formulaire

source: Form components are the building blocks of a form. Several types of component exist. Most types share the following subset of parameters:
fr: Les composants de formulaire sont les blocs de construction d'un formulaire. Plusieurs types de composant existent. La plupart des types partagent le sous-ensemble de paramètres suivants:

source: Name
fr: Nom

source: This should be a unique identifier of the form component. It will be used as the HTML element's ``name`` attribute value.
fr: Cela doit être un identifiant unique du composant. Il sera utilisé comme valeur pour l'attribut ``name`` de l'élément HTML.

source: Label
fr: Libellé

source: The text that will be displayed in front of the form element
fr: Le texte sera affiché devant l'élément de formulaire

source: Help text
fr: Texte d'aide

source: A more detailed description of the form element and what is expected from the user. It should be displayed next to the label, but depending on the theme used it could be different.
fr: Une description plus détaillée de l'élément du formulaire et ce qui est attendu de l'utilisateur. Il devrait être affiché à côté du libellé, mais selon le thème utilisé cela peut être différent.

source: Required
fr: Requis

source: Required form components prevent the form to be submitted if they are empty (not set).
fr: Les composants de formulaire requis empêchent le formulaire d'être soumis s'ils sont vides (non définis).

source: For parameters specific to a form component type, see below.
fr: Pour les paramètres spécifiques à un type de composant, voir ci-dessous.

source: Checkbox
fr: Case à cocher

source: A simple checkbox that is unchecked by default.
fr: Une simple case à cocher qui est non-cochée par défaut.

source: Dropdown list
fr: Liste déroulante

source: A dropdown list, whose options can be set manually or be retrieved from a "Custom Vocab" vocabulary
fr: Une liste déroulante, dont les options peuvent être définies manuellement ou récupérées depuis un vocabulaire "Custom Vocab"

source: A list of options, one per line
fr: Une liste d'options, une par ligne

source: This parameter is visible only if Custom Vocab module is enabled. If set, the "Options" parameter is ignored.
fr: Ce paramètre est visible uniquement si le module Custom Vocab est activé. Si défini, le paramètre "Options" est ignoré.

source: File upload
fr: Chargement de fichier

source: Allow user to upload files
fr: Permet à l'utilisateur de charger des fichiers

source: Accepted file types
fr: Types de fichier acceptés

source: A comma-separated list of accepted file types. If empty, all file types are accepted.
fr: Une liste de types de fichier acceptés. Si vide, tous les types de fichier sont acceptés.

source: Accepted file extensions
fr: Extensions de fichier acceptées

source: A comma-separated list of accepted file extensions. If empty, all file extensions are accepted.
fr: Une liste d'extensions de fichier acceptées. Si vide, toutes les extensions de fichier sont acceptées.

source: Maximum file size
fr: Taille de fichier maximale

source: Maximum file size in bytes or in SI notation. For instance "10485760" or "10MB".
fr: Taille de fichier maximale en octets ou en notation SI. Par exemple, "10485760" ou "10MB".

source: This component type allow to add arbitrary HTML in the form
fr: Ce type de composant permet d'ajouter du HTML arbitraire dans le formulaire

source: The HTML code to be added to the form. A WYSIWYG editor is available.
fr: Le code HTML à ajouter au formulaire. Un éditeur WYSIWYG est disponible.

source: Prevent spam with reCAPTCHA (Google). Requires "reCAPTCHA site key" and "reCAPTCHA secret key" to be set (see `security settings <https://omeka.org/s/docs/user-manual/admin/settings/#security>`__)
fr: Empêche le spam avec reCAPTCHA (Google). Nécessite que les paramètres "clé du site reCAPTCHA" et "clé secrète reCAPTCHA" soient définis (voir `paramètres de sécurité <https://omeka.org/s/docs/user-manual/admin/settings/#security>`__)

source: Text area
fr: Zone de texte

source: A multi-line text input
fr: Un champ texte multi-lignes

source: Text input
fr: Champ texte

source: A simple text input
fr: Un champ texte simple

source: User e-mail address
fr: Adresse e-mail utilisateur

source: This is like "Text input" but is automatically set to user's email if user is authenticated.
fr: Similaire à "Champ texte" mais est automatiquement défini à l'adresse e-mail de l'utilisateur s'il est authentifié.

source: Form submissions
fr: Soumissions de formulaire

source: To view form submissions, go to the admin interface and click on "Formularium" in the navigation menu, and then on "Form submissions" (in the navigation menu too).
fr: Pour consulter les soumissions de formulaire, allez sur l'interface d'admin et cliquez sur "Formularium" dans le menu de navigation, puis sur "Soumissions de formulaire" (dans le menu de navigation également).

source: Details of each submission can be viewed by clicking on the "details" link (the three horizontal dots).
fr: Les détails de chaque soumission peuvent être consultés en cliquant sur le lien "détails" (les trois points horizontaux).

source: Submissions can be marked as handled and deleted, one by one or by batch.
fr: Les soumissions peuvent être marquées comme traitées et supprimées, une par une ou par lot.

source: Forms
fr: Formulaires

source: Create a new form
fr: Créer un nouveau formulaire

source: To create a new form, go to the admin interface and click on "Formularium" in the navigation menu.
fr: Pour créer un nouveau formulaire, allez sur l'interface d'admin et cliquez sur "Formularium" dans le menu de navigation.

source: Then click on "Add new form"
fr: Puis cliquez sur "Ajouter un nouveau formulaire"

source: Give it a name, then click on "Add a component" to add your first component.
fr: Donnez lui un nom, puis cliquez sur "Ajouter un composant" pour ajouter votre premier composant.

source: In the sidebar, select the type of component you want to add, for instance "User e-mail address", and complete the component's settings form.
fr: Dans la barre latérale, sélectionnez le type de composant que vous souhaitez ajouter, par exemple "Adresse e-mail utilisateur", et complétez le formulaire de paramétrage du composant.

source: You can add as many components as you want and reorder them. You may also add actions. Actions are executed after a successful form submission.
fr: Vous pouvez ajouter autant de composants que vous le voulez et modifier leur ordre. Vous pouvez aussi ajouter des actions. Les actions sont exécutées après une soumission de formulaire réussie.

source: Once you're done, click on "Add" to save the form.
fr: Quand vous avez terminé, cliquer sur "Ajouter" pour enregistrer le formulaire.

source: See :doc:`form-components` and :doc:`form-actions` to get more details about their settings.
fr: Voir :doc:`form-components` et :doc:`form-actions` pour avoir plus de détails à propos de leur paramètres.

source: Add the form to a site page
fr: Ajouter le formulaire à une page de site

source: To make the form visible to your users, you must add the "Formularium" block to a site page, and select your form in the block settings.
fr: Pour rendre le formulaire visible à vos utilisateurs, vous devez ajouter le bloc "Formularium" à une page de site, et sélectionner votre formulaire dans les paramètres du bloc.

source: The page will look like this (with the default theme):
fr: La page ressemblera à ceci (avec le thème par défaut):

source: Form submissions can be viewed and managed in :doc:`the form submissions page <form-submissions>`
fr: Les soumissions de formulaire sont consultables et gérables sur :doc:`la page des soumissions de formulaire <form-submissions>`

source: Formularium documentation
fr: Documentation de Formularium

source: `Formularium`_ is a module for Omeka S. It allows administrators to build forms for public sites.
fr: `Formularium`_ est un module pour Omeka S. Il permet aux administrateurs de construire des formulaires pour les sites publics.

source: Form submissions are saved and can be viewed from the administration interface.
fr: Les soumissions de formulaires sont enregistrées et sont consultables depuis l'interface d'administration.

source: Submitting a form can also trigger several "actions". There is only one kind of action at the moment: sending an email.
fr: Soumettre un formulaire peut aussi déclencher plusieurs "actions". Il n'y a qu'un seul type d'action pour le moment: envoyer un e-mail.

source: Goals
fr: Objectifs

source: The primary goal of this module is to be a viable alternative for client-specific "contact us"-type forms.
fr: L'objectif principal de ce module est d'être une alternative viable aux formulaires spécifiques de type "contactez-nous".

source: It is also extensible so that other modules can add their own form components and actions.
fr: Il est aussi extensible afin que d'autres modules puissent ajouter leurs propres composants de formulaire et leurs propres actions.

source: Requirements
fr: Exigences

source: Quick start
fr: Démarrage rapide

source: `Add the module to Omeka S <https://omeka.org/s/docs/user-manual/modules/#adding-modules-to-omeka-s>`__
fr: `Ajouter le module à Omeka S <https://omeka.org/s/docs/user-manual/modules/#adding-modules-to-omeka-s>`__

source: In the administration interface, click on "Formularium" in the navigation menu
fr: Dans l'interface d'administration, cliquez sur "Formularium" dans le menu de navigation

source: Create a new form, give it a name and add "components" (form elements)
fr: Créez un nouveau formulaire, donnez lui un nom et ajoutez des "composants" (éléments de formulaire)

source: Optionally, add actions
fr: Éventuellement, ajoutez des actions

source: Create a new page for your site, and add the "Formularium" block to this page. In the block settings, select the form you created.
fr: Créez une nouvelle page pour votre site, et ajoutez le bloc "Formularium" à cette page. Dans les paramètres du bloc, sélectionnez le formulaire que vous avez créé.

source: Features
fr: Fonctionnalités

source: Create unlimited forms with an unlimited number of components and actions
fr: Créez une infinité de formulaires avec une infinité de composants et d'actions

source: Different component types: text, text area, dropdown list, checkbox, antispam (recaptcha), file upload, ... (other modules can add their own)
fr: Différents types de composants: texte, zone de texte, liste déroulante, case à cocher, antispam (recaptcha), chargement de fichier, ... (d'autres modules peuvent ajouter les leurs)

source: One action type: send an email (other modules can add their own)
fr: Un type d'action: envoyer un e-mail (d'autres modules peuvent ajouter les leurs)

source: Form submissions are entirely saved (uploaded files included) so they can be viewed later. Deleting a form submission also removes the attached files.
fr: Les soumissions de formulaire sont entièrement sauvegardées (y compris les fichiers chargés) pour pouvoir être consultables ultérieurement. Supprimer une soumission de formulaire supprime également les fichiers attachés.

source: A flag can be set to mark a form submission as "handled" (whatever that means to you)
fr: Une marque peut être posée pour marquer une soumission de formulaire comme étant "traitée" (quoi que ça signifie pour vous)

source: Form submissions can be filtered by form, site, user (if an authenticated user has made a submission), and handled status
fr: Les soumissions de formulaire peuvent être filtrées par formulaire, site, utilisateur (si un utilisateur authentifié a fait une soumission), et par status traité

source: Form submissions can be batch deleted and batch edited (batch edit only allows to change the handled status)
fr: Les soumissions de formulaires peuvent être supprimées et modifiées par lot (la modification par lot permet uniquement de modifier le statut traité)

source: Comparison with similar modules
fr: Comparaison avec les modules similaires

source: Contact Us is easier to set up. Formularium is more customizable
fr: Contact Us est plus facile à mettre en place. Formularium est plus personnalisable

source: Contact Us has two antispam solutions: simple and recaptcha. Formularium has only recaptcha
fr: Contact Us a deux solutions antispam: simple et recaptcha. Formularium a seulement recaptcha

source: Table of contents
fr: Table des matières
